///////////////////╔═══╗╔══╗─╔══╗─╔══╗╔╗╔╗╔══╗───╔╗///////////////////
///////////////////╚══╗║║╔╗║─║╔╗║─║╔╗║║║║║║╔╗║──╔╝║///////////////////
///////////////////─╔═╝║║╚╝║─║║║║─║╚╝║║╚╝║║╚╝║──╚╗║///////////////////
///////////////////─╚═╗║║╔╗║─║║║║─║╔╗║╚═╗║║╔╗║───║║///////////////////
///////////////////╔══╝║║║║║╔╝╚╝╚╗║║║║──║║║║║║───║║///////////////////
///////////////////╚═══╝╚╝╚╝╚════╝╚╝╚╝──╚╝╚╝╚╝───╚╝///////////////////
// В доме 5 подъездов по 20 квартир каждый.
// Получите от пользователя номер квартиры и взамен выдайте в консоль номер подъезда.
// Учитывайте, что пользователь может ввести число меньше 1 или больше 100.
//


// let a
// let error = "";
// do {
//     a = parseInt(prompt(error + "Введите номер квартиры"));
//     error = "Вы ввели не число! ";
// } while (isNaN(a));
// let counter
// for (counter = 0; a > 0; a -= 20) {
//     counter++;
// }
// console.log("Подъезд", a);


////////////////////╔═══╗╔══╗─╔══╗─╔══╗╔╗╔╗╔══╗──╔══╗////////////////////
////////////////////╚══╗║║╔╗║─║╔╗║─║╔╗║║║║║║╔╗║──╚═╗║////////////////////
////////////////////─╔═╝║║╚╝║─║║║║─║╚╝║║╚╝║║╚╝║──╔═╝║////////////////////
////////////////////─╚═╗║║╔╗║─║║║║─║╔╗║╚═╗║║╔╗║──║╔═╝////////////////////
////////////////////╔══╝║║║║║╔╝╚╝╚╗║║║║──║║║║║║──║╚═╗////////////////////
////////////////////╚═══╝╚╝╚╝╚════╝╚╝╚╝──╚╝╚╝╚╝──╚══╝////////////////////


// let a = prompt("Введите название марки");
// switch (a) {
//     case (a = "Ferrari"):
//         console.log(a, "- Страна происхождения Италия")
//         break;
//     case (a = "Bmw"):
//         console.log(a, "- Страна происхождения Германия")
//         break;
//     case (a = "Ford"):
//         console.log(a, "- Страна происхождения США");
//         break;
//     case (a = "Peugeot"):
//         console.log(a, "- Страна происхождения Франция");
//         break;
//     case (a = "McLaren"):
//         console.log(a, "- Страна происхождения Британия");
//         break;
//     case (a = "Porsche"):
//         console.log(a, "- Страна происхождения Германия");
//         break;
//     case (a = "Renault"):
//         console.log(a, "- Страна происхождения Франция");
//         break;
//     default:
//         console.log("Марка и страна происхождения неопределина");
//         break;
// }

// loop 3 \\
// let a = parseInt(prompt("Введите год"));
// if (isNaN(a)) {
//     a = parseInt(prompt("Введите год второй раз!"));
// }
// if (a % 4 == 0 && a % 100 != 0 || a % 400 == 0){
//     console.log("Год високосный")
// } else {
//     console.log("Год не весокосный")
// }


// loop 4 \\

// let a = parseInt(prompt("Введите номер"));
// if (isNaN(a)) {
//     a = parseInt(prompt("Введите номер второй раз!"));
// }
// for (let a = 1; a <= 20; a++) {
//     for (let counter = 1; counter <= 20; counter++) {
//         console.log(a + "x" + counter + "=" + a * counter);
//     }
// }


//  loop 5  \\
for (let a = 1; a <= 4; a++) {
    for (let b = 1; b <= 1; b++)
    console.log("#" + " " + "#" + " " + "#" + " " + "#" + " ");
        console.log(" " + "#" + " " + "#" + " " + "#" + " " + "#");


}
